# 6. Дано рядок. Якщо в цьому рядку буква f зустрічається тільки один раз,
# виведіть її індекс. Якщо вона зустрічається два і більше разів,
# виведіть індекс її першого і останнього входження.
# Якщо буква f в цьому рядку не зустрічається, нічого не виводьте.

str = input ("Enter your string >>> ")

if str.count('f') == 1:
    print(str.find('f'))
elif str.count('f') >= 2:
    print(str.find('f'), str.rfind('f'))
